src/cf/Catalogs/инт_ПотокиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПотокиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьОбработанныеСообщенияЧерез</Name>
					<Comment>Количество дней, через которое обработанные сообщения будут удалены(0 - сообщения не удаляются)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валидация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Comment>Сериализованное представление примера исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АсинхроннаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСхемыПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкомпилированныйОбработчик</Name>
					<Comment>Скомпилированная внешняя обработка (EPF) из текста обработчика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСкомпилированногоОбработчика</Name>
					<Comment>Признак версии: хеш текста, из которого получен СкомпилированныйОбработчик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписчикиПотока</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаВходящиеСообщения</Name>
					<Comment>Источники входящих сообщений (Kafka/RabbitMQ консьюмеры)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Comment>Подписчик Kafka или RabbitMQ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_ПотокиДанных/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Валидация Тогда
		ПроверяемыеРеквизиты.Добавить("СхемаДанных");
		ПроверяемыеРеквизиты.Добавить("ИмяСхемыПакета");
	КонецЕсли;
	
	Если НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		ПроверяемыеРеквизиты.Добавить("Пример");
		ПроверяемыеРеквизиты.Добавить("ОтслеживаемыеРеквизиты");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		ПроверитьОтслеживаемыеРеквизиты(Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтслеживаемыеРеквизиты) И ЗначениеЗаполнено(Пример) Тогда
		ПримерСсылка = ЗначениеИзСтрокиВнутр(Пример);
		ОтслеживаемыеРеквизиты = ЗначениеВСтрокуВнутр(Справочники.инт_ПотокиДанных.ЗаполнитьДеревоРеквизитовПоСсылке(ПримерСсылка, Неопределено));
	КонецЕсли;
	
	ОбеспечитьСкомпилированныйОбработчик();
	
	ОтметитьУстановкуСрокаХраненияОбработанныхСообщений();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Обеспечить скомпилированный обработчик
// Проверяет, соответствует ли СкомпилированныйОбработчик текущему ТекстуОбработчика.
// Если текст изменился или EPF отсутствует — компилирует заново.
// Пропускает компиляцию, если она уже выполнена формой (флаг в ДополнительныхСвойствах).
//
Процедура ОбеспечитьСкомпилированныйОбработчик()
	
	// Форма уже скомпилировала EPF — повторно не компилируем.
	Если ДополнительныеСвойства.Свойство("ОбработчикСкомпилирован") Тогда
		Возврат;
	КонецЕсли;
	
	// Нет текста обработчика — очищаем скомпилированный EPF.
	Если Не ЗначениеЗаполнено(ТекстОбработчика) Тогда
		СкомпилированныйОбработчик = Новый ХранилищеЗначения(Неопределено);
		Возврат;
	КонецЕсли;
	
	// Для существующих элементов: если текст не изменился и EPF уже есть — пропускаем.
	Если Не Ссылка.Пустая() Тогда
		ТекстВБазе = Ссылка.ТекстОбработчика;
		Если ТекстОбработчика = ТекстВБазе
			И Ссылка.СкомпилированныйОбработчик.Получить() <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Компилируем EPF и сохраняем.
	ДвоичныеДанныеEPF = инт_ГенераторОбработок.СкомпилироватьОбработку(ТекстОбработчика);
	СкомпилированныйОбработчик = Новый ХранилищеЗначения(ДвоичныеДанныеEPF);
	
КонецПроцедуры

// Процедура - Отметить установку срока хранения обработанных сообщений
// Отмечает в дополнительных свойствах, что в потоке задали новый срок хранения обработанных сообщений:
// сообщениям, обработанным до этого момента, дату удаления не проставляли.
// Регистрацию таких сообщений запускает форма потока после записи - в транзакции записи
// платформа не разрешает запускать фоновые задания.
//
Процедура ОтметитьУстановкуСрокаХраненияОбработанныхСообщений()
	Если ЭтоНовый() Или УдалятьОбработанныеСообщенияЧерез <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеЗначения = инт_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "УдалятьОбработанныеСообщенияЧерез");
	Если ПрежниеЗначения.УдалятьОбработанныеСообщенияЧерез <> УдалятьОбработанныеСообщенияЧерез Тогда
		ДополнительныеСвойства.Вставить("ЗарегистрироватьОбработанныеСообщенияКУдалению", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьОтслеживаемыеРеквизиты(Отказ)
	Дерево = ЗначениеИзСтрокиВнутр(ОтслеживаемыеРеквизиты);
	
	Если Дерево.Строки.Найти(1, "ОтслеживатьИзменения", Истина) = Неопределено Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка! Не отслеживается изменение ни одного поля!";
		Сообщение.Поле = "ОпределитьОтслеживаемыеРеквизиты"; //имя реквизита
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
